import 'package:cloud_firestore/cloud_firestore.dart';

List<String> allItems = [
  'Αγγλικής Γλώσσας και Φιλολογίας',
  'Αγροτικής Ανάπτυξης',
  'Αρχιτεκτόνων Μηχανικών',
  'Βιολογίας',
  'Γαλλικής Γλώσσας και Φιλολογίας',
  'Γεωλογίας',
  'Γεωπονίας',
  'Δημοσιογραφίας και ΜΜΕ',
  'Δημόσιας Διοίκησης',
  'Διοίκησης Επιχειρήσεων',
  'Εικαστικών και Εφαρμοσμένων Τεχνών',
  'Επιστήμης Φυσικής Αγωγής και Αθλητισμού',
  'Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών',
  'Ιατρικής',
  'Ιστορίας και Αρχαιολογίας',
  'Ιταλικής Γλώσσας και Φιλολογίας',
  'Κτηνιατρικής',
  'Μαθηματικού',
  'Μηχανικών Χωροταξίας και Ανάπτυξης',
  'Μηχανολόγων Μηχανικών',
  'Μουσικών Σπουδών',
  'Νομικής',
  'Νοσηλευτικής',
  'Ξένων Γλωσσών, Μετάφρασης και Διερμηνείας',
  'Οικονομικών Επιστημών',
  'Παιδαγωγικό Δημοτικής Εκπαίδευσης',
  'Παιδαγωγικό Ειδικής Αγωγής',
  'Παιδαγωγικό Νηπιαγωγών',
  'Πολιτικών Επιστημών',
  'Πολιτικών Μηχανικών',
  'Πολιτισμού και Δημιουργικών Μέσων',
  'Πληροφορικής',
  'Προγραμμάτων Σπουδών Πολιτισμού',
  'Προγραμμάτων Σπουδών Τουρισμού',
  'Στατιστικής και Αναλογιστικών-Χρηματοοικονομικών Μαθηματικών',
  'Σπουδών Νοτιοανατολικής Ευρώπης',
  'Σπουδών Σλαβικών Γλωσσών και Φιλολογιών',
  'Σχολή Θεολογίας',
  'Σχολή Καλών Τεχνών',
  'Τεχνολογίας Τροφίμων',
  'Φαρμακευτικής',
  'Φιλολογίας',
  'Φιλοσοφίας και Παιδαγωγικής',
  'Φυσικής',
  'Χημείας',
  'Ψυχολογίας'

];

Future<void> updateStatistics() async {
  final firestore = FirebaseFirestore.instance;

  // Αρχικοποίηση map με 0 για κάθε σχολή
  Map<String, int> counts = { for (var item in allItems) item: 0 };
  counts['Άλλο'] = 0; // Προσθήκη της κατηγορίας "Άλλο"
  int totalUsers = 0;

  // Λήψη όλων των χρηστών από τη συλλογή users
  final snapshot = await firestore.collection('users').get();

  for (var doc in snapshot.docs) {
    final university = doc['University'];

    if (university != null && university.toString().trim().isNotEmpty) {
      if (counts.containsKey(university)) {
        counts[university] = counts[university]! + 1;
      } else {
        counts['Άλλο'] = counts['Άλλο']! + 1;
      }
      totalUsers++;
    }
  }

  // Αφαίρεση σχολών με 0 αν δεν τις θέλεις στο τελικό document
  counts.removeWhere((key, value) => value == 0);

  // Αποθήκευση στο Firestore
  await firestore.collection('schoolStats').doc('summary').set({
    'totalUsers': totalUsers,
    'schools': counts,
  });
}
